{
    "subject": "Computer Science",
    "grade": 10,
    "topics": [
        {
            "name": "Introduction to Computer",
            "subtopics": [
                {
                    "name": "Basic Concepts",
                    "concepts": [
                        {
                            "name": "What is a Computer?",
                            "summary": "A computer is an electronic device that processes data according to a set of instructions. It can perform arithmetic and logical operations automatically. Computers can store, retrieve, and process data, making them essential tools in modern society.",
                            "steps": [
                                "Define a computer as an electronic device",
                                "Explain data processing capabilities",
                                "Describe storage and retrieval functions",
                                "Discuss the role of instructions (programs)"
                            ],
                            "questions": [
                                {
                                    "question": "What is a computer?",
                                    "acceptable_answers": [
                                        "An electronic device that processes data according to instructions",
                                        "A machine that can store, retrieve, and process data",
                                        "An electronic device that performs arithmetic and logical operations"
                                    ],
                                    "hints": [
                                        "Think about what makes a computer different from other machines",
                                        "Consider both the hardware and software aspects",
                                        "Remember that computers follow instructions to process data"
                                    ]
                                },
                                {
                                    "question": "What are the main functions of a computer?",
                                    "acceptable_answers": [
                                        "Processing data, storing information, and retrieving data",
                                        "Performing calculations and following instructions",
                                        "Input, processing, output, and storage of data"
                                    ],
                                    "hints": [
                                        "Consider what happens when you use a computer",
                                        "Think about the basic operations a computer performs",
                                        "Remember that computers can both store and process information"
                                    ]
                                }
                            ]
                        },
                        {
                            "name": "Types of Computers",
                            "summary": "Computers come in various forms, from supercomputers to embedded systems. They can be classified based on size, processing power, and purpose. Common types include personal computers, servers, mainframes, and mobile devices.",
                            "steps": [
                                "List different types of computers",
                                "Explain the characteristics of each type",
                                "Compare processing power and capabilities",
                                "Discuss common uses for each type"
                            ],
                            "questions": [
                                {
                                    "question": "What are the main types of computers?",
                                    "acceptable_answers": [
                                        "Personal computers, servers, mainframes, and mobile devices",
                                        "Supercomputers, mainframes, minicomputers, and microcomputers",
                                        "Desktop computers, laptops, tablets, and smartphones"
                                    ],
                                    "hints": [
                                        "Consider the size and power of different computers",
                                        "Think about where and how each type is used",
                                        "Remember that computers can be classified by their capabilities"
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "name": "Computer Hardware",
                    "concepts": [
                        {
                            "name": "Basic Components",
                            "summary": "A computer consists of several essential hardware components: the Central Processing Unit (CPU), memory (RAM), storage devices, input devices, and output devices. Each component plays a vital role in the computer's operation.",
                            "steps": [
                                "Identify the main hardware components",
                                "Explain the function of each component",
                                "Describe how components work together",
                                "Discuss the importance of each part"
                            ],
                            "questions": [
                                {
                                    "question": "What are the main hardware components of a computer?",
                                    "acceptable_answers": [
                                        "CPU, memory, storage, input devices, and output devices",
                                        "Processor, RAM, hard drive, keyboard, and monitor",
                                        "Central processing unit, memory, storage, and peripheral devices"
                                    ],
                                    "hints": [
                                        "Think about the physical parts you can see and touch",
                                        "Consider what each part does in the computer",
                                        "Remember that hardware includes both internal and external components"
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "name": "Programming Basics",
            "subtopics": [
                {
                    "name": "Introduction to Programming",
                    "concepts": [
                        {
                            "name": "What is Programming?",
                            "summary": "Programming is the process of creating a set of instructions that tell a computer how to perform a task. It involves writing code in a programming language that the computer can understand and execute.",
                            "steps": [
                                "Define programming and its purpose",
                                "Explain the role of programming languages",
                                "Describe the programming process",
                                "Discuss the importance of algorithms"
                            ],
                            "questions": [
                                {
                                    "question": "What is programming?",
                                    "acceptable_answers": [
                                        "The process of creating instructions for computers to follow",
                                        "Writing code to tell computers what to do",
                                        "Creating a set of commands that computers can execute"
                                    ],
                                    "hints": [
                                        "Think about how we communicate with computers",
                                        "Consider what programming languages are used for",
                                        "Remember that programming involves problem-solving"
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        }
    ]
} 