{
    "subject": "English",
    "grade": 10,
    "topics": [
        {
            "name": "Reading Comprehension",
            "subtopics": [
                {
                    "name": "Understanding Main Ideas",
                    "concepts": [
                        {
                            "name": "Identifying Main Ideas",
                            "summary": "The main idea is the central thought or message of a text. It is what the author wants the reader to understand about the topic. Supporting details provide evidence and examples that help explain and develop the main idea.",
                            "steps": [
                                "Read the entire text carefully",
                                "Look for repeated ideas or themes",
                                "Identify the topic sentence",
                                "Consider the author's purpose"
                            ],
                            "questions": [
                                {
                                    "question": "What is a main idea in a text?",
                                    "acceptable_answers": [
                                        "The central thought or message the author wants to convey",
                                        "The most important point the author is making",
                                        "The primary concept that the text is about"
                                    ],
                                    "hints": [
                                        "Think about what the author is trying to tell you",
                                        "Look for the most important point in the text",
                                        "Consider what the text is mainly about"
                                    ]
                                },
                                {
                                    "question": "How can you identify the main idea?",
                                    "acceptable_answers": [
                                        "By looking for repeated themes and the topic sentence",
                                        "By finding the most important point the author makes",
                                        "By understanding what the text is mainly about"
                                    ],
                                    "hints": [
                                        "Look for ideas that appear multiple times",
                                        "Find the sentence that states the main point",
                                        "Consider what the author emphasizes"
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "name": "Grammar",
            "subtopics": [
                {
                    "name": "Parts of Speech",
                    "concepts": [
                        {
                            "name": "Nouns and Pronouns",
                            "summary": "Nouns are words that name people, places, things, or ideas. Pronouns are words that take the place of nouns to avoid repetition. Understanding nouns and pronouns is essential for clear communication.",
                            "steps": [
                                "Define what nouns are",
                                "Explain different types of nouns",
                                "Describe how pronouns work",
                                "Show examples of proper usage"
                            ],
                            "questions": [
                                {
                                    "question": "What is a noun?",
                                    "acceptable_answers": [
                                        "A word that names a person, place, thing, or idea",
                                        "A word that identifies people, places, or objects",
                                        "A word that represents a person, place, or thing"
                                    ],
                                    "hints": [
                                        "Think about words that name things",
                                        "Consider what we use to identify objects",
                                        "Remember that nouns can be concrete or abstract"
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        }
    ]
} 